{
  "_schema": "Work experience - type: full-time | part-time | internship | contract | fellowship, newest first",
  "experience": [
    {
      "id": "nycha-2025",
      "company": "New York City Housing Authority (NYCHA)",
      "role": "Cybersecurity Intern",
      "location": "New York, NY",
      "period": "June 2025 - Present",
      "type": "internship",
      "description": "One of two interns competitively selected from 200+ applicants to join the Cybersecurity team at the largest public housing authority in North America, serving 339,900+ residents across 277 developments. Supporting enterprise-wide threat detection, incident response, and vulnerability management for critical infrastructure.",
      "highlights": [
        "Monitor and investigate 500+ daily security events using Splunk SIEM, developing custom correlation rules that reduced false positives by 35% and improved mean time to detection",
        "Perform threat hunting and incident triage using CrowdStrike Falcon EDR, contributing to the investigation and containment of potential compromises across 15,000+ endpoints",
        "Assist in vulnerability management lifecycle, analyzing Qualys scan data to prioritize remediation of 2,500+ critical CVEs affecting production infrastructure serving NYC residents",
        "Collaborate with security engineers on DLP policy implementation protecting PII of 339,900+ residents, achieving 99.7% data classification accuracy",
        "Author incident response procedures and contribute to SOC runbooks, reducing average analyst onboarding time by 40% through improved documentation"
      ],
      "tech": ["Splunk", "CrowdStrike Falcon", "Qualys", "SIEM", "EDR", "Incident Response", "Threat Hunting", "Vulnerability Management", "DLP"]
    },
    {
      "id": "sbu-bjj-2023",
      "company": "Stony Brook University Brazilian Jiu-Jitsu Club",
      "role": "Treasurer & Assistant Coach",
      "location": "Stony Brook, NY",
      "period": "September 2023 - Present",
      "type": "part-time",
      "description": "Elected to executive board of 80+ member martial arts organization. Manage $15,000+ annual budget while leading technical instruction for beginner and intermediate practitioners.",
      "highlights": [
        "Manage $15,000+ annual operating budget, negotiating vendor contracts and sponsorships that increased club funding by 25% year-over-year",
        "Lead 3-4 weekly training sessions for 20-30 members, developing structured curriculum that improved student retention rate from 40% to 70%",
        "Coach competition team that placed top 3 at NAGA New York and Grappling Industries events, with 8 members earning medals in 2024",
        "Coordinate with university administration on liability, insurance, and facility booking, maintaining compliance with club sports requirements",
        "Organize quarterly seminars with visiting black belt instructors, managing event logistics for 50+ attendees"
      ],
      "tech": ["Budget Management", "Event Coordination", "Leadership", "Coaching", "Curriculum Development"]
    },
    {
      "id": "bbb-2024",
      "company": "Beyer Blinder Belle Architects",
      "role": "Design & Construction Technology Intern",
      "location": "New York, NY",
      "period": "June 2024 - August 2024",
      "type": "internship",
      "description": "Developed automation solutions for a 150+ person architecture firm specializing in historic preservation projects including Grand Central Terminal and Ellis Island. Built internal tools that replaced manual workflows and improved data reliability across 40+ active projects valued at $500M+.",
      "highlights": [
        "Architected Python automation framework that consolidated 12 disparate Excel macros and Power Automate flows into unified system, reducing manual processing time by 85% and saving estimated 20+ hours per week firm-wide",
        "Engineered fault-tolerant task scheduling system with automatic retry logic, comprehensive logging, and real-time email notifications for unattended BIM file management across 40+ concurrent projects",
        "Designed and implemented SQLite database schema for centralized project metadata storage, enabling PowerBI dashboards that provided real-time visibility into file health and compliance status",
        "Established coding standards and documentation practices following PEP8, with version control workflows that enabled seamless handoff—framework still in active use 6+ months after internship",
        "Presented automation solutions to firm principals, receiving commendation for initiative and technical problem-solving"
      ],
      "tech": ["Python", "Tkinter", "SQLite", "PowerBI", "Git", "Windows Task Scheduler", "BIM", "Automation", "Revit API"]
    },
    {
      "id": "freelance-2023",
      "company": "Independent Consulting",
      "role": "Freelance Software Developer",
      "location": "Remote",
      "period": "January 2023 - Present",
      "type": "contract",
      "description": "Provide software development and technical consulting services to small businesses and startups, specializing in web applications, automation, and system architecture.",
      "highlights": [
        "Delivered 8+ client projects ranging from $2,000-$15,000, maintaining 100% on-time delivery rate and 5-star client satisfaction",
        "Built custom inventory management system for e-commerce client, reducing manual data entry by 90% and integrating with Shopify API",
        "Developed automated lead generation pipeline using Python and web scraping, generating 500+ qualified leads monthly for real estate client",
        "Architected and deployed full-stack web applications using Next.js and PostgreSQL, with CI/CD pipelines and production monitoring",
        "Provide ongoing maintenance and support contracts, generating recurring revenue while building long-term client relationships"
      ],
      "tech": ["Next.js", "React", "Python", "PostgreSQL", "Shopify API", "Web Scraping", "CI/CD", "AWS"]
    },
    {
      "id": "bottomline-2022",
      "company": "Bottom Line",
      "role": "College Success Scholar",
      "location": "New York, NY",
      "period": "August 2022 - May 2025",
      "type": "fellowship",
      "description": "Selected for competitive 6-year college success and career readiness program for high-potential, first-generation college students. Part of national network with 90%+ college graduation rate (vs. 21% national average for similar demographics). One of 50 scholars selected from 500+ applicants.",
      "highlights": [
        "Received ongoing 1:1 executive coaching from senior professionals at Goldman Sachs, Google, and McKinsey on career strategy and professional development",
        "Completed 200+ hours of intensive workshops on technical interviewing, salary negotiation, and personal branding that directly contributed to securing competitive internships",
        "Engaged in long-term career planning with dedicated advisor, developing strategic approach that resulted in 3 internship offers from Fortune 500 companies",
        "Led peer mentorship cohort of 8 incoming scholars, achieving 100% retention rate and highest satisfaction scores in program history",
        "Selected to represent Bottom Line at corporate partner events, networking with executives and advocating for first-generation student initiatives"
      ],
      "tech": ["Career Development", "Professional Networking", "Leadership", "Mentorship", "Public Speaking"]
    },
    {
      "id": "tutoring-2022",
      "company": "Private Practice",
      "role": "Computer Science & Mathematics Tutor",
      "location": "New York, NY",
      "period": "September 2022 - Present",
      "type": "part-time",
      "description": "Provide personalized tutoring in computer science fundamentals, data structures, algorithms, and mathematics for high school and college students. Build custom learning materials and practice problems.",
      "highlights": [
        "Tutored 25+ students in CS fundamentals, data structures, algorithms, and discrete mathematics with average grade improvement of 1.5 letter grades",
        "Developed comprehensive problem sets and study guides for common CS courses (CSE 114, CSE 214, CSE 215) used by multiple students",
        "Coached 5 students through technical interview preparation, with 4 receiving internship offers at tech companies including Amazon and Bloomberg",
        "Maintained 4.9/5 rating across 100+ sessions, with 80% of clients requesting ongoing tutoring relationships",
        "Built reputation through referrals, growing client base organically without advertising"
      ],
      "tech": ["Java", "Python", "Data Structures", "Algorithms", "Discrete Math", "Technical Interview Prep"]
    },
    {
      "id": "hardy-2023",
      "company": "The Hardy Group",
      "role": "Data & Operations Analyst",
      "location": "New York, NY",
      "period": "October 2023 - December 2023",
      "type": "internship",
      "description": "Supported data operations for boutique real estate advisory firm specializing in $10M+ commercial transactions. Led critical CRM migration and established data management protocols that improved operational efficiency.",
      "highlights": [
        "Led end-to-end migration of 2,000+ customer records from Salesforce to Airtable, designing relational schema that improved query performance by 60% and eliminated data redundancy",
        "Built automated reporting pipelines using Excel VBA and Airtable automations that reduced weekly reporting time from 4 hours to 30 minutes",
        "Implemented data validation protocols and entry standards that reduced error rates by 40%, improving targeting accuracy for $2M+ marketing campaigns",
        "Created executive dashboard providing real-time visibility into sales pipeline, deal velocity, and conversion metrics for leadership team",
        "Documented all processes and trained 3 team members on new systems, ensuring sustainable adoption after departure"
      ],
      "tech": ["Airtable", "Salesforce", "Excel VBA", "Data Migration", "CRM", "Data Analysis", "Process Automation"]
    },
    {
      "id": "isl-2022",
      "company": "International Socioeconomics Laboratory",
      "role": "Executive Web Developer",
      "location": "Remote",
      "period": "May 2022 - August 2022",
      "type": "part-time",
      "description": "Led technical strategy and development for student-run research organization publishing policy analysis on global socioeconomic issues. Managed complete website rebuild while coordinating with executive leadership and 15+ student researchers.",
      "highlights": [
        "Spearheaded complete website redesign using Vue.js and modern JAMstack architecture, improving page load times by 60% and achieving 95+ Lighthouse performance score",
        "Implemented SEO optimizations that increased organic traffic by 200% within 3 months, reaching 10,000+ monthly visitors from policy research community",
        "Established CI/CD pipeline with GitHub Actions for automated testing and deployment, reducing deployment time from hours to minutes",
        "Provided technical consultation to executive board on digital strategy, infrastructure investments, and long-term scalability planning",
        "Mentored 3 junior developers in modern web development practices, with all continuing in technical roles after program"
      ],
      "tech": ["Vue.js", "JavaScript", "HTML/CSS", "GitHub Actions", "CI/CD", "SEO", "Technical Leadership", "JAMstack"]
    },
    {
      "id": "finxerunt-2021",
      "company": "Finxerunt Policy Institute",
      "role": "Lead Web Developer & Co-Founder",
      "location": "Remote",
      "period": "September 2021 - April 2022",
      "type": "part-time",
      "description": "Co-founded and led the web development team for student policy research organization, building technical foundation from scratch. Grew team from 0 to 10 developers while establishing engineering culture and practices.",
      "highlights": [
        "Recruited, trained, and led team of 10 student developers across 4 time zones, establishing code review processes and documentation standards that ensured consistent quality",
        "Architected and launched organization's entire web presence from scratch, implementing responsive design that increased mobile engagement by 150% and reduced bounce rate by 40%",
        "Built content management system allowing non-technical editors to publish research articles, enabling 50+ publications in first year",
        "Contributed to executive strategy as founding team member, helping grow organization from 5 to 60+ members across 3 countries",
        "Developed comprehensive onboarding curriculum reducing new developer ramp-up time from 4 weeks to 2 weeks"
      ],
      "tech": ["HTML/CSS", "JavaScript", "React", "Node.js", "Team Leadership", "Technical Mentorship", "Agile", "CMS Development"]
    }
  ]
}
