{
  "_schema": "Work experience - type: full-time | part-time | internship | contract, newest first",
  "experience": [
    {
      "id": "nycha-2025",
      "company": "New York City Housing Authority (NYCHA)",
      "role": "Cybersecurity Intern",
      "location": "New York, NY",
      "period": "June 2025 - August 2025",
      "type": "internship",
      "description": "One of two interns selected to join NYCHA's Cybersecurity team, supporting threat detection, incident response, and vulnerability management at the largest public housing authority in North America.",
      "highlights": [
        "Monitored and investigated security events using Splunk (SIEM) and CrowdStrike Falcon (EDR)",
        "Assisted in incident response workflows, including triage, threat analysis, and remediation support",
        "Contributed to vulnerability management, including reviewing scan data and risk prioritization",
        "Shadowed security engineers to gain exposure to endpoint protection, DLP, and security control implementation"
      ],
      "tech": ["Splunk", "CrowdStrike Falcon", "SIEM", "EDR", "Incident Response", "Vulnerability Management"]
    },
    {
      "id": "bbb-2024",
      "company": "Beyer Blinder Belle",
      "role": "Design & Construction Technology Intern",
      "location": "New York, NY",
      "period": "June 2024 - August 2024",
      "type": "internship",
      "description": "Automated BIM file management workflows and built data dashboards for architecture firm.",
      "highlights": [
        "Developed Python scripts to automate BIM file management, replacing Excel Macros and MS Power Automate flows with Tkinter GUI",
        "Integrated Windows Task Scheduler for unattended execution with data verification, logging, and automatic retries",
        "Researched and integrated SQLite and PowerBI for data storage and meta-health dashboards"
      ],
      "tech": ["Python", "Tkinter", "SQLite", "PowerBI", "Git", "Automation"]
    },
    {
      "id": "hardy-2023",
      "company": "The Hardy Group",
      "role": "Marketing Intern",
      "location": "New York, NY",
      "period": "October 2023 - December 2023",
      "type": "internship",
      "description": "Data migration and analysis for real estate marketing firm.",
      "highlights": [
        "Migrated customer data from Salesforce to Airtable for improved data management",
        "Used Microsoft Excel for efficient data management, analysis, and reporting",
        "Reorganized company data implementing data entry protocols that enhanced accuracy"
      ],
      "tech": ["Airtable", "Salesforce", "Excel", "Data Analysis"]
    },
    {
      "id": "isl-2022",
      "company": "International Socioeconomics Laboratory",
      "role": "Web Developer",
      "location": "Remote",
      "period": "May 2022 - August 2022",
      "type": "part-time",
      "description": "Executive Web Developer managing a team to rebuild the company website using modern frameworks.",
      "highlights": [
        "Managed a team to rebuild the company website using newer programming frameworks",
        "Oversaw project timeline and ensured completion within schedule",
        "Improved website performance and reliability through regular maintenance and updates"
      ],
      "tech": ["Vue.js", "HTML", "CSS", "JavaScript", "GitHub"]
    },
    {
      "id": "finxerunt-2021",
      "company": "Finxerunt Policy Institute",
      "role": "Lead Web Developer",
      "location": "Remote",
      "period": "September 2021 - April 2022",
      "type": "part-time",
      "description": "Led a team of 10 students in designing and implementing the company website.",
      "highlights": [
        "Led a team of 10 students in designing and implementing the company website",
        "Contributed to executive meetings, providing insights on managerial improvements",
        "Trained students in programming and web development"
      ],
      "tech": ["HTML", "CSS", "Squarespace", "Web Development", "Team Leadership"]
    }
  ]
}
