{
  "_schema": "Profile information - edit this to update personal details",
  "profile": {
    "name": "Fardin Iqbal",
    "tagline": "Engineer, Philosopher, Grappler",
    "bio": [
      "Fardin Iqbal builds software with the same deliberation he brings to the mat. A computer science student at Stony Brook University entering his final semester, he has already moved beyond the conventional path—founding a healthcare startup, architecting personal AI infrastructure, and coaching Brazilian Jiu-Jitsu at the university club.",
      "His work spans from systems-level programming (custom malloc implementations, concurrent servers) to full-stack applications that solve tangible problems. Currently, he is building Neo Provider, a platform designed to streamline clinical documentation for Early Intervention therapists. Alongside this, he has constructed Prometheus—a personal AI infrastructure featuring 30+ custom skills, from investigative journalism tools to self-optimizing systems.",
      "Beyond code, Fardin is a practitioner of big questions. He reads Nietzsche and Marcus Aurelius not as academic exercises but as guides to living. His essays explore the nature of power, love, and meaning with the same rigor he applies to debugging distributed systems.",
      "He trains Brazilian Jiu-Jitsu with competition aspirations, viewing the sport as philosophy made physical—a practice in humility, adaptation, and controlled aggression. The lessons from the mat inform how he approaches engineering: stay calm under pressure, find leverage in constraints, and never stop moving forward."
    ],
    "location": "New York, NY",
    "email": "fardin.iqbal1@gmail.com",
    "education": {
      "school": "Stony Brook University",
      "degree": "B.S.",
      "major": "Computer Science",
      "graduationDate": "May 2026",
      "gpa": "3.13",
      "activities": "Treasurer & Assistant Coach - Brazilian Jiu-Jitsu Club"
    },
    "social": {
      "github": "https://github.com/FardinIqbal",
      "linkedin": "https://www.linkedin.com/in/fardin-iqbal",
      "twitter": null
    },
    "resumeUrl": "/resume/Fardin_Iqbal_Resume.pdf",
    "topSkills": ["Full-Stack Development", "Systems Programming", "AI Infrastructure", "Ruby on Rails", "TypeScript", "Brazilian Jiu-Jitsu"]
  }
}
